Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/pio/pic32ck2051sg01100.h
#define PIN_PA04M_CCL_IN9                          _UINT32_(4) 
#define MUX_PA04M_CCL_IN9                          _UINT32_(12)
#define PINMUX_PA04M_CCL_IN9                       ((PIN_PA04M_CCL_IN9 << 16) | MUX_PA04M_CCL_IN9)
#define PORT_PA04M_CCL_IN9                         (_UINT32_(1) << 4)

#define PIN_PA13M_CCL_IN9                          _UINT32_(13)
#define MUX_PA13M_CCL_IN9                          _UINT32_(12)
#define PINMUX_PA13M_CCL_IN9                       ((PIN_PA13M_CCL_IN9 << 16) | MUX_PA13M_CCL_IN9)
#define PORT_PA13M_CCL_IN9                         (_UINT32_(1) << 13)

#define PIN_PA05M_CCL_IN10                         _UINT32_(5) 
#define MUX_PA05M_CCL_IN10                         _UINT32_(12)
#define PINMUX_PA05M_CCL_IN10                      ((PIN_PA05M_CCL_IN10 << 16) | MUX_PA05M_CCL_IN10)
#define PORT_PA05M_CCL_IN10                        (_UINT32_(1) << 5)

#define PIN_PA14M_CCL_IN10                         _UINT32_(14)
#define MUX_PA14M_CCL_IN10                         _UINT32_(12)
#define PINMUX_PA14M_CCL_IN10                      ((PIN_PA14M_CCL_IN10 << 16) | MUX_PA14M_CCL_IN10)
#define PORT_PA14M_CCL_IN10                        (_UINT32_(1) << 14)

#define PIN_PA06M_CCL_IN11                         _UINT32_(6) 
#define MUX_PA06M_CCL_IN11                         _UINT32_(12)
#define PINMUX_PA06M_CCL_IN11                      ((PIN_PA06M_CCL_IN11 << 16) | MUX_PA06M_CCL_IN11)
#define PORT_PA06M_CCL_IN11                        (_UINT32_(1) << 6)

#define PIN_PA15M_CCL_IN11                         _UINT32_(15)
#define MUX_PA15M_CCL_IN11                         _UINT32_(12)
#define PINMUX_PA15M_CCL_IN11                      ((PIN_PA15M_CCL_IN11 << 16) | MUX_PA15M_CCL_IN11)
#define PORT_PA15M_CCL_IN11                        (_UINT32_(1) << 15)

#define PIN_PB10M_CCL_OUT0                         _UINT32_(42)
#define MUX_PB10M_CCL_OUT0                         _UINT32_(12)
#define PINMUX_PB10M_CCL_OUT0                      ((PIN_PB10M_CCL_OUT0 << 16) | MUX_PB10M_CCL_OUT0)
#define PORT_PB10M_CCL_OUT0                        (_UINT32_(1) << 10)

#define PIN_PC13M_CCL_OUT1                         _UINT32_(77)
#define MUX_PC13M_CCL_OUT1                         _UINT32_(12)
#define PINMUX_PC13M_CCL_OUT1                      ((PIN_PC13M_CCL_OUT1 << 16) | MUX_PC13M_CCL_OUT1)
#define PORT_PC13M_CCL_OUT1                        (_UINT32_(1) << 13)

#define PIN_PD11M_CCL_OUT2                         _UINT32_(107)
#define MUX_PD11M_CCL_OUT2                         _UINT32_(12)
#define PINMUX_PD11M_CCL_OUT2                      ((PIN_PD11M_CCL_OUT2 << 16) | MUX_PD11M_CCL_OUT2)
#define PORT_PD11M_CCL_OUT2                        (_UINT32_(1) << 11)

#define PIN_PA07M_CCL_OUT3                         _UINT32_(7) 
#define MUX_PA07M_CCL_OUT3                         _UINT32_(12)
#define PINMUX_PA07M_CCL_OUT3                      ((PIN_PA07M_CCL_OUT3 << 16) | MUX_PA07M_CCL_OUT3)
#define PORT_PA07M_CCL_OUT3                        (_UINT32_(1) << 7)

#define PIN_PA16M_CCL_OUT3                         _UINT32_(16)
#define MUX_PA16M_CCL_OUT3                         _UINT32_(12)
#define PINMUX_PA16M_CCL_OUT3                      ((PIN_PA16M_CCL_OUT3 << 16) | MUX_PA16M_CCL_OUT3)
#define PORT_PA16M_CCL_OUT3                        (_UINT32_(1) << 16)

/* ========== PORT definition for EBI peripheral ========== */
#define PIN_PC19E_EBI_A2                           _UINT32_(83)
#define MUX_PC19E_EBI_A2                           _UINT32_(4) 
#define PINMUX_PC19E_EBI_A2                        ((PIN_PC19E_EBI_A2 << 16) | MUX_PC19E_EBI_A2)
#define PORT_PC19E_EBI_A2                          (_UINT32_(1) << 19)

#define PIN_PC18E_EBI_A3                           _UINT32_(82)
#define MUX_PC18E_EBI_A3                           _UINT32_(4) 
#define PINMUX_PC18E_EBI_A3                        ((PIN_PC18E_EBI_A3 << 16) | MUX_PC18E_EBI_A3)
#define PORT_PC18E_EBI_A3                          (_UINT32_(1) << 18)

#define PIN_PC17E_EBI_A4                           _UINT32_(81)
#define MUX_PC17E_EBI_A4                           _UINT32_(4) 
#define PINMUX_PC17E_EBI_A4                        ((PIN_PC17E_EBI_A4 << 16) | MUX_PC17E_EBI_A4)
#define PORT_PC17E_EBI_A4                          (_UINT32_(1) << 17)

#define PIN_PC16E_EBI_A5                           _UINT32_(80)
#define MUX_PC16E_EBI_A5                           _UINT32_(4) 
#define PINMUX_PC16E_EBI_A5                        ((PIN_PC16E_EBI_A5 << 16) | MUX_PC16E_EBI_A5)
#define PORT_PC16E_EBI_A5                          (_UINT32_(1) << 16)

#define PIN_PC15E_EBI_A6                           _UINT32_(79)
#define MUX_PC15E_EBI_A6                           _UINT32_(4) 
#define PINMUX_PC15E_EBI_A6                        ((PIN_PC15E_EBI_A6 << 16) | MUX_PC15E_EBI_A6)
#define PORT_PC15E_EBI_A6                          (_UINT32_(1) << 15)

#define PIN_PC05E_EBI_A7                           _UINT32_(69)
#define MUX_PC05E_EBI_A7                           _UINT32_(4) 
#define PINMUX_PC05E_EBI_A7                        ((PIN_PC05E_EBI_A7 << 16) | MUX_PC05E_EBI_A7)
#define PORT_PC05E_EBI_A7                          (_UINT32_(1) << 5)

#define PIN_PC14E_EBI_A8                           _UINT32_(78)
#define MUX_PC14E_EBI_A8                           _UINT32_(4) 
#define PINMUX_PC14E_EBI_A8                        ((PIN_PC14E_EBI_A8 << 16) | MUX_PC14E_EBI_A8)
#define PORT_PC14E_EBI_A8                          (_UINT32_(1) << 14)

#define PIN_PC04E_EBI_A9                           _UINT32_(68)
#define MUX_PC04E_EBI_A9                           _UINT32_(4) 
#define PINMUX_PC04E_EBI_A9                        ((PIN_PC04E_EBI_A9 << 16) | MUX_PC04E_EBI_A9)
#define PORT_PC04E_EBI_A9                          (_UINT32_(1) << 4)

#define PIN_PC03E_EBI_A10                          _UINT32_(67)
#define MUX_PC03E_EBI_A10                          _UINT32_(4) 
#define PINMUX_PC03E_EBI_A10                       ((PIN_PC03E_EBI_A10 << 16) | MUX_PC03E_EBI_A10)
#define PORT_PC03E_EBI_A10                         (_UINT32_(1) << 3)

#define PIN_PC02E_EBI_A11                          _UINT32_(66)
#define MUX_PC02E_EBI_A11                          _UINT32_(4) 
#define PINMUX_PC02E_EBI_A11                       ((PIN_PC02E_EBI_A11 << 16) | MUX_PC02E_EBI_A11)
#define PORT_PC02E_EBI_A11                         (_UINT32_(1) << 2)

#define PIN_PC01E_EBI_A12                          _UINT32_(65)
#define MUX_PC01E_EBI_A12                          _UINT32_(4) 
#define PINMUX_PC01E_EBI_A12                       ((PIN_PC01E_EBI_A12 << 16) | MUX_PC01E_EBI_A12)
#define PORT_PC01E_EBI_A12                         (_UINT32_(1) << 1)

#define PIN_PC00E_EBI_A13                          _UINT32_(64)
#define MUX_PC00E_EBI_A13                          _UINT32_(4) 
#define PINMUX_PC00E_EBI_A13                       ((PIN_PC00E_EBI_A13 << 16) | MUX_PC00E_EBI_A13)
#define PORT_PC00E_EBI_A13                         (_UINT32_(1) << 0)

#define PIN_PB10E_EBI_A14                          _UINT32_(42)
#define MUX_PB10E_EBI_A14                          _UINT32_(4) 
#define PINMUX_PB10E_EBI_A14                       ((PIN_PB10E_EBI_A14 << 16) | MUX_PB10E_EBI_A14)
#define PORT_PB10E_EBI_A14                         (_UINT32_(1) << 10)

#define PIN_PB09E_EBI_A15                          _UINT32_(41)
#define MUX_PB09E_EBI_A15                          _UINT32_(4) 
#define PINMUX_PB09E_EBI_A15                       ((PIN_PB09E_EBI_A15 << 16) | MUX_PB09E_EBI_A15)
#define PORT_PB09E_EBI_A15                         (_UINT32_(1) << 9)

#define PIN_PD08E_EBI_A16                          _UINT32_(104)
#define MUX_PD08E_EBI_A16                          _UINT32_(4) 
#define PINMUX_PD08E_EBI_A16                       ((PIN_PD08E_EBI_A16 << 16) | MUX_PD08E_EBI_A16)
#define PORT_PD08E_EBI_A16                         (_UINT32_(1) << 8)

#define PIN_PD07E_EBI_A17                          _UINT32_(103)
#define MUX_PD07E_EBI_A17                          _UINT32_(4) 
#define PINMUX_PD07E_EBI_A17                       ((PIN_PD07E_EBI_A17 << 16) | MUX_PD07E_EBI_A17)
#define PORT_PD07E_EBI_A17                         (_UINT32_(1) << 7)

#define PIN_PD06E_EBI_A18                          _UINT32_(102)
#define MUX_PD06E_EBI_A18                          _UINT32_(4) 
#define PINMUX_PD06E_EBI_A18                       ((PIN_PD06E_EBI_A18 << 16) | MUX_PD06E_EBI_A18)
#define PORT_PD06E_EBI_A18                         (_UINT32_(1) << 6)

