Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/include/pio/pic32ck2051sg01100.h
#define PIN_PC15F_TCC1_WO0                         _UINT32_(79)
#define MUX_PC15F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PC15F_TCC1_WO0                      ((PIN_PC15F_TCC1_WO0 << 16) | MUX_PC15F_TCC1_WO0)
#define PORT_PC15F_TCC1_WO0                        (_UINT32_(1) << 15)

#define PIN_PC06G_TCC1_WO1                         _UINT32_(70)
#define MUX_PC06G_TCC1_WO1                         _UINT32_(6) 
#define PINMUX_PC06G_TCC1_WO1                      ((PIN_PC06G_TCC1_WO1 << 16) | MUX_PC06G_TCC1_WO1)
#define PORT_PC06G_TCC1_WO1                        (_UINT32_(1) << 6)

#define PIN_PC16F_TCC1_WO1                         _UINT32_(80)
#define MUX_PC16F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PC16F_TCC1_WO1                      ((PIN_PC16F_TCC1_WO1 << 16) | MUX_PC16F_TCC1_WO1)
#define PORT_PC16F_TCC1_WO1                        (_UINT32_(1) << 16)

#define PIN_PC07G_TCC1_WO2                         _UINT32_(71)
#define MUX_PC07G_TCC1_WO2                         _UINT32_(6) 
#define PINMUX_PC07G_TCC1_WO2                      ((PIN_PC07G_TCC1_WO2 << 16) | MUX_PC07G_TCC1_WO2)
#define PORT_PC07G_TCC1_WO2                        (_UINT32_(1) << 7)

#define PIN_PC17F_TCC1_WO2                         _UINT32_(81)
#define MUX_PC17F_TCC1_WO2                         _UINT32_(5) 
#define PINMUX_PC17F_TCC1_WO2                      ((PIN_PC17F_TCC1_WO2 << 16) | MUX_PC17F_TCC1_WO2)
#define PORT_PC17F_TCC1_WO2                        (_UINT32_(1) << 17)

#define PIN_PC09G_TCC1_WO3                         _UINT32_(73)
#define MUX_PC09G_TCC1_WO3                         _UINT32_(6) 
#define PINMUX_PC09G_TCC1_WO3                      ((PIN_PC09G_TCC1_WO3 << 16) | MUX_PC09G_TCC1_WO3)
#define PORT_PC09G_TCC1_WO3                        (_UINT32_(1) << 9)

#define PIN_PC18F_TCC1_WO3                         _UINT32_(82)
#define MUX_PC18F_TCC1_WO3                         _UINT32_(5) 
#define PINMUX_PC18F_TCC1_WO3                      ((PIN_PC18F_TCC1_WO3 << 16) | MUX_PC18F_TCC1_WO3)
#define PORT_PC18F_TCC1_WO3                        (_UINT32_(1) << 18)

#define PIN_PC15G_TCC1_WO4                         _UINT32_(79)
#define MUX_PC15G_TCC1_WO4                         _UINT32_(6) 
#define PINMUX_PC15G_TCC1_WO4                      ((PIN_PC15G_TCC1_WO4 << 16) | MUX_PC15G_TCC1_WO4)
#define PORT_PC15G_TCC1_WO4                        (_UINT32_(1) << 15)

#define PIN_PC19F_TCC1_WO4                         _UINT32_(83)
#define MUX_PC19F_TCC1_WO4                         _UINT32_(5) 
#define PINMUX_PC19F_TCC1_WO4                      ((PIN_PC19F_TCC1_WO4 << 16) | MUX_PC19F_TCC1_WO4)
#define PORT_PC19F_TCC1_WO4                        (_UINT32_(1) << 19)

#define PIN_PC10G_TCC1_WO5                         _UINT32_(74)
#define MUX_PC10G_TCC1_WO5                         _UINT32_(6) 
#define PINMUX_PC10G_TCC1_WO5                      ((PIN_PC10G_TCC1_WO5 << 16) | MUX_PC10G_TCC1_WO5)
#define PORT_PC10G_TCC1_WO5                        (_UINT32_(1) << 10)

#define PIN_PC20F_TCC1_WO5                         _UINT32_(84)
#define MUX_PC20F_TCC1_WO5                         _UINT32_(5) 
#define PINMUX_PC20F_TCC1_WO5                      ((PIN_PC20F_TCC1_WO5 << 16) | MUX_PC20F_TCC1_WO5)
#define PORT_PC20F_TCC1_WO5                        (_UINT32_(1) << 20)

#define PIN_PC11G_TCC1_WO6                         _UINT32_(75)
#define MUX_PC11G_TCC1_WO6                         _UINT32_(6) 
#define PINMUX_PC11G_TCC1_WO6                      ((PIN_PC11G_TCC1_WO6 << 16) | MUX_PC11G_TCC1_WO6)
#define PORT_PC11G_TCC1_WO6                        (_UINT32_(1) << 11)

#define PIN_PC12G_TCC1_WO7                         _UINT32_(76)
#define MUX_PC12G_TCC1_WO7                         _UINT32_(6) 
#define PINMUX_PC12G_TCC1_WO7                      ((PIN_PC12G_TCC1_WO7 << 16) | MUX_PC12G_TCC1_WO7)
#define PORT_PC12G_TCC1_WO7                        (_UINT32_(1) << 12)

/* ========== PORT definition for TCC2 peripheral ========== */
#define PIN_PD05G_TCC2_WO0                         _UINT32_(101)
#define MUX_PD05G_TCC2_WO0                         _UINT32_(6) 
#define PINMUX_PD05G_TCC2_WO0                      ((PIN_PD05G_TCC2_WO0 << 16) | MUX_PD05G_TCC2_WO0)
#define PORT_PD05G_TCC2_WO0                        (_UINT32_(1) << 5)

#define PIN_PA00F_TCC2_WO0                         _UINT32_(0) 
#define MUX_PA00F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PA00F_TCC2_WO0                      ((PIN_PA00F_TCC2_WO0 << 16) | MUX_PA00F_TCC2_WO0)
#define PORT_PA00F_TCC2_WO0                        (_UINT32_(1) << 0)

#define PIN_PD06G_TCC2_WO1                         _UINT32_(102)
#define MUX_PD06G_TCC2_WO1                         _UINT32_(6) 
#define PINMUX_PD06G_TCC2_WO1                      ((PIN_PD06G_TCC2_WO1 << 16) | MUX_PD06G_TCC2_WO1)
#define PORT_PD06G_TCC2_WO1                        (_UINT32_(1) << 6)

#define PIN_PD12F_TCC2_WO1                         _UINT32_(108)
#define MUX_PD12F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PD12F_TCC2_WO1                      ((PIN_PD12F_TCC2_WO1 << 16) | MUX_PD12F_TCC2_WO1)
#define PORT_PD12F_TCC2_WO1                        (_UINT32_(1) << 12)

#define PIN_PD07G_TCC2_WO2                         _UINT32_(103)
#define MUX_PD07G_TCC2_WO2                         _UINT32_(6) 
#define PINMUX_PD07G_TCC2_WO2                      ((PIN_PD07G_TCC2_WO2 << 16) | MUX_PD07G_TCC2_WO2)
#define PORT_PD07G_TCC2_WO2                        (_UINT32_(1) << 7)

#define PIN_PD11F_TCC2_WO2                         _UINT32_(107)
#define MUX_PD11F_TCC2_WO2                         _UINT32_(5) 
#define PINMUX_PD11F_TCC2_WO2                      ((PIN_PD11F_TCC2_WO2 << 16) | MUX_PD11F_TCC2_WO2)
#define PORT_PD11F_TCC2_WO2                        (_UINT32_(1) << 11)

#define PIN_PD08G_TCC2_WO3                         _UINT32_(104)
#define MUX_PD08G_TCC2_WO3                         _UINT32_(6) 
#define PINMUX_PD08G_TCC2_WO3                      ((PIN_PD08G_TCC2_WO3 << 16) | MUX_PD08G_TCC2_WO3)
#define PORT_PD08G_TCC2_WO3                        (_UINT32_(1) << 8)

#define PIN_PA01F_TCC2_WO3                         _UINT32_(1) 
#define MUX_PA01F_TCC2_WO3                         _UINT32_(5) 
#define PINMUX_PA01F_TCC2_WO3                      ((PIN_PA01F_TCC2_WO3 << 16) | MUX_PA01F_TCC2_WO3)
#define PORT_PA01F_TCC2_WO3                        (_UINT32_(1) << 1)

